package pansong291.piano.wizard.consts

import android.os.Environment

object StringConst {
    /**
     * 外部存储路径
     */
    val EXTERNAL_PATH: String by lazy { Environment.getExternalStorageDirectory().path }

    /**
     * 乐谱后缀
     */
    const val MUSIC_NOTATION_FILE_EXT = ".yp.txt"

    /**
     * 默认数据存储文件名
     */
    const val SHARED_PREFERENCES_NAME = "piano_wizard"

    /**
     * 全部键盘布局数据
     */
    const val SP_DATA_KEY_KEY_LAYOUTS = "key_layouts"

    /**
     * 上次使用的布局。Int
     */
    const val SP_DATA_KEY_LAST_LAYOUT = "last_layout"

    /**
     * 默认目录
     */
    const val SP_DATA_KEY_DEFAULT_FOLDER = "default_folder"

    /**
     * SkyStudio 乐谱的上次选择目录
     */
    const val SP_DATA_KEY_SKY_STUDIO_SHEET_LAST_FOLDER = "sky_studio_sheet_last_folder"

    /**
     * Midi 文件的上次选择目录
     */
    const val SP_DATA_KEY_MIDI_FILE_LAST_FOLDER = "midi_file_last_folder"

    /**
     * 演奏设置
     */
    const val SP_DATA_KEY_MUSIC_PLAYING_SETTINGS = "music_playing_settings"

    /**
     * SkyStudio 乐谱的文件后缀
     */
    const val SKY_STUDIO_SHEET_FILE_EXT = ".txt"

    /**
     * Midi 文件的后缀
     */
    const val MIDI_FILE_EXT = ".mid"

    /**
     * 备份文件的后缀
     */
    const val BAK_FILE_EXT = ".bak"

    const val ABOUT_QQ_GROUP_NUMBER = "试用版"
    const val ABOUT_REPOSITORY_LINK = "试用版"
    const val TRIAL_MUSIC_NAME = "试用版音乐.yp.txt"
    const val TRIAL_MUSIC_CONTENT =
        "[1=C,4/4,240]1+*2,2+*2,3+*2,1+*2,1+*2,2+*2,3+*2,1+*2,3+*2,4+*2,5+*4,3+*2,4+*2,5+*4,5+,6+,5+,4+,3+*2,1+*2,5+,6+,5+,4+,3+*2,1+*2,1+*2,5*2,1+*4,1+*2,5*2,1+*4,5,5,6*2,5*2,1+*2,7*4,5,5,6*2,5*2,2+*2,1+*4,5,5,5+*2,3+*2,1+*2,7*2,6*2,4+,4+,3+*2,1+*2,2+*2,1+*4,1+,1+,5+,5+,6+,6+,5+*2,4+,4+,3+,3+,2+,2+,1+*2,5+,5+,4+,4+,3+,3+,2+*2,5+,5+,4+,4+,3+,3+,2+*2,1+,1+,5+,5+,6+,6+,5+*2,4+,4+,3+,3+,2+,2+,1+*2,1+2*4,7+*4,5+*4,3+*4,1+*4,7*4,5*4,2*8,3*8,3+*8,3*2,5*2,6*4,6*2,1+*2,2+*4,3+*2,5+*2,3+*4,2+*2,1+*2,6*4,3+*2,2+*2,6*4,3+*2,2+*2,6*4,5*4,3*2,3*2,6*2,7*2,1+*4,3*2,5*2,6*4,6*2,1+*2,2+*4,3+*2,5+*2,3+*4,2+*2,1+*2,6*4,3+*2,2+*2,6*4,3+*2,2+*2,6*4,5*4,6*2,3*2,6*2,7*2,1+*4,3+*2,5+*2,6+*4,6+*2,5+*2,6+*4,7+*2,5+*2,6+*4,5+*2,2+*2,3+*4,3+*2,5+*2,6+*6,5+*2,6+*2,1+2*2,7+*2,5+*2,3+*2,3*2,6*2,7*2,1+*4,3+*2,5+*2,6+*6,5+*2,6+*4,7+*2,5+*2,6+*4,5+*2,2+*2,3+*4,3+*2,2+*2,6*4,3+*2,2+*2,6*4,5*4,6*2,3*2,6*2,7*2,1+*4,3*2,5*2,6*4,6*2,1+*2,2+*4,3+*2,5+*2,3+*4,2+*2,1+*2,6*4,3+*2,2+*2,6*4,3+*2,2+*2,6*4,5*4,6*4,6+,6+,6+*2,5+*2,1+2,6+*3,6+,5+*2,5+,6+,2+,3+*4,3+*2,5+,5+*2,5+,1+*3,3+,2+,1+*2,6*2,5,6*4,4+*2,4+,6,4+*2,3+,2+*4,3+*2,3+,2+,1+*2,6*2,3+*4,2+*2,2+,3+,5+*2,3+,5+*3,2+,3+*2,5+,5+*2,6+,7+*4,5+,6+*2,6+*2,3+*2,5+*2,1+2,6+*4,5+,6+*2,1+2*2,1+2*2,6+*2,5+,3+*4,2+*2,2+,3+,5+,3+,5+*2,5+,3+*2,5+,2+,1+,6*2,3+*2,3+*2,3+*4,3+*2,1+,6*3,3+,5+,5+,3+,5+*2,6+,3+*4,5+,6+,6+,6+,5+,1+2,6+*2,6+,1+2,1+2,6+,1+2*2,1+2,7+*4,1+2,6+,6+,6+,6+,5+,6+,6+*2,5+,6+,1+2,6+*4,5+*4,1+2*4,6+*4,"
}
